In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.038793  0.777580
1  bar    one  0.452518  0.606171
2  foo    two  0.610322 -0.980807
3  bar  three -1.949199  1.271093
4  foo    two -1.517767 -0.104183
5  bar    two  1.067188  0.612135
6  foo    one  1.232959  0.477968
7  foo  three  2.242563 -1.008390

In [2]:
grouped = df.groupby('A')

In [3]:
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [8]:
grouped = df.groupby(['A','B'])
grouped.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

In [22]:
'''
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'
grouped = df.groupby(get_letter_type,axis = 1)
grouped.count().iloc[0]
'''

def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'

# 转置 DataFrame
df_transposed = df.T

# 对转置后的 DataFrame 进行分组
grouped = df_transposed.groupby(get_letter_type)

# 计算分组后的计数并获取第一行
result = grouped.count().iloc[:, 0]

result

a    1
b    3
Name: 0, dtype: int64

In [34]:
s = pd.Series([1,2,3,1,2,3],[8,7,5,8,7,5])
# s = pd.Series([1, 2, 3, 1, 2, 3], index=[8, 7, 5, 8, 7, 5])
s

8    1
7    2
5    3
8    1
7    2
5    3
dtype: int64

In [35]:
grouped = s.groupby(level = 0) # 按索引分组 groupby是default按列分组 level是按行分组

In [36]:
grouped.first() # 每个分组的第一个值 8 7 5

5    3
7    2
8    1
dtype: int64

In [37]:
grouped.last() # 每个分组的最后一个值 5 7 8

5    3
7    2
8    1
dtype: int64

In [38]:
grouped.sum()

5    6
7    4
8    2
dtype: int64

In [51]:
grouped = s.groupby(level = 0,sort =False) # 不排序

In [52]:
grouped.first()

8    1
7    2
5    3
dtype: int64

In [53]:
df2 = pd.DataFrame({'X':['A','B','A','B'],'Y':[1,2,3,4]})
df2

   X  Y
0  A  1
1  B  2
2  A  3
3  B  4

In [58]:
df2.groupby(['X']).get_group(('A',))

   X  Y
0  A  1
2  A  3

In [61]:
df2.groupby(['X']).get_group(('B',))

   X  Y
1  B  2
3  B  4

In [62]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [63]:
index = pd.MultiIndex.from_arrays(arrays, names=['first','second'])

In [81]:
s = pd.Series(np.random.randn(8), index=index) #random.randn取值范围是-1-1 random.random取值范围是0-1
s

first  second
bar    one      -1.132326
       two      -0.599358
baz    one      -0.877368
       two      -0.108964
foo    one       1.811536
       two       0.201086
qux    one       1.419379
       two       0.516041
dtype: float64

In [83]:
grouped = s.groupby(level=0)
grouped.sum()

first
bar   -1.731684
baz   -0.986332
foo    2.012623
qux    1.935420
dtype: float64

In [84]:
grouped = s.groupby(level=1)
grouped.sum()

second
one    1.221221
two    0.008805
dtype: float64

In [85]:
grouped = s.groupby(level = 'first')
grouped.sum()

first
bar   -1.731684
baz   -0.986332
foo    2.012623
qux    1.935420
dtype: float64

In [86]:
df

     A      B         C         D
0  foo    one  1.038793  0.777580
1  bar    one  0.452518  0.606171
2  foo    two  0.610322 -0.980807
3  bar  three -1.949199  1.271093
4  foo    two -1.517767 -0.104183
5  bar    two  1.067188  0.612135
6  foo    one  1.232959  0.477968
7  foo  three  2.242563 -1.008390

In [92]:
grouped = df.groupby(['A','B']) # 按A B分组
grouped.aggregate("sum") # 求A B分组 C D的和

                  C         D
A   B
bar one    0.452518  0.606171
    three -1.949199  1.271093
    two    1.067188  0.612135
foo one    2.271752  1.255548
    three  2.242563 -1.008390
    two   -0.907445 -1.084989

In [101]:
grouped = df.groupby(['A','B'], as_index=False) # as_index=False 不把分组的列作为索引
grouped.aggregate('sum')

     A      B         C         D
0  bar    one  0.452518  0.606171
1  bar  three -1.949199  1.271093
2  bar    two  1.067188  0.612135
3  foo    one  2.271752  1.255548
4  foo  three  2.242563 -1.008390
5  foo    two -0.907445 -1.084989

In [94]:
df.groupby(['A','B']).sum().reset_index() # reset_index() 重新设置索引

     A      B         C         D
0  bar    one  0.452518  0.606171
1  bar  three -1.949199  1.271093
2  bar    two  1.067188  0.612135
3  foo    one  2.271752  1.255548
4  foo  three  2.242563 -1.008390
5  foo    two -0.907445 -1.084989

In [95]:
grouped = df.groupby(['A','B']) 
grouped.size() # 每个分组的大小

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [97]:
grouped.describe().head() # 每个分组的描述性统计 head() 显示前5行

              C                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0  0.452518       NaN  0.452518  0.452518  0.452518  0.452518
    three   1.0 -1.949199       NaN -1.949199 -1.949199 -1.949199 -1.949199
    two     1.0  1.067188       NaN  1.067188  1.067188  1.067188  1.067188
foo one     2.0  1.135876  0.137296  1.038793  1.087334  1.135876  1.184417
    three   1.0  2.242563       NaN  2.242563  2.242563  2.242563  2.242563

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one    0.452518   1.0  0.606171       NaN  0.606171  0.606171  0.606171
    three -1.949199   1.0  1.271093       NaN  1.271093  1.271093  1.271093
    two    1.067188   1.0  0.612135       NaN  0.612135  0.612135  0.612135
foo one    1.232959   2.0  0.627774  0.211858  0.477968  0.552871  0.627774
    three  2.242563   1.0 -1.008390       NaN -1.008390 -1.008390 -1.008390


                75%       max
A   B
bar one    0.606171  0.606171
    three  1.271093  1.271093
    two    0.612135  0.612135
foo one    0.702677  0.777580
    three -1.008390 -1.008390

In [102]:
# 通过字典指定不同列的不同函数
grouped = df.groupby('A')
grouped['C'].agg(['sum','mean','std'])

          sum      mean       std
A
bar -0.429493 -0.143164  1.593981
foo  3.606869  0.721374  1.387676

In [106]:
# 为每个列指定不同的函数 agg({'列名1':函数1,'列名2':函数2})
grouped['C'].agg([('res_sum', 'sum'), ('res_mean', 'mean'), ('res_std', 'std')])

      res_sum  res_mean   res_std
A
bar -0.429493 -0.143164  1.593981
foo  3.606869  0.721374  1.387676